# Groupby  and Aggregations
----

## 1. Create Dataframe

In [3]:
import pandas as pd
sales = pd.DataFrame({
'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
'bread': [139, 237, 326, 456],
'butter': [20, 45, 70, 98]
})

In [4]:
# 01. Observe Sales Data
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

## 2. Total Sales
> what is the total sales?

In [5]:
sales[["bread","butter"]].sum().sum() # select sum(bread) + sum(butter) from sales

1391

## 3. Groupby and sum
> what is the toatal bread sales dayname wise ?

In [6]:
sales.groupby('weekday')['bread'].sum()# select weekday,sum(bread) from sales group by weekday

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

## 4. Groupby and sum on multiple columns
> weekday wise different products sales ?

In [7]:
sales.groupby('weekday').sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

> **or**

In [8]:
sales.groupby('weekday')[['bread','butter']].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

## 5. Groupby and mean: multi-level index

In [9]:
sales.groupby(['city','weekday']).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

## 7. Group by and max on multiple columns

In [10]:
sales.groupby('city')[['bread','butter']].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

## 8. Multiple aggregations

In [11]:
sales.groupby('weekday')[['bread','butter']].agg(['max','min','sum'])

        bread           butter
          max  min  sum    max min  sum
weekday
Mon       456  326  782     98  70  168
Sun       237  139  376     45  20   65

## 9. Custom aggregation

In [12]:
def data_range(series):
    return series.max() - series.min()

In [13]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

> Home Work: http://pandas.pydata.org/pandas-docs/stable/getting_started/tutorials.html